app/views/posts/show.html.erb

<div id="comments">
    <% if @post.comments.present? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]