app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "name", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hello there"], ["name", "jane"], ["post_id", 4], ["created_at", "2020-01-11 01:52:11.440948"], ["updated_at", "2020-01-11 01:52:11.440948"]]
---
    def create
        @comment = @post.comments.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Zorp class comment for sure"], ["updated_at", "2020-01-11 15:59:40.620639"], ["id", 1]]
---
    def update
        @comment = Comment.find(params[:id])
        @comment.update(comment_params)