app/controllers/pages_controller.rb

    def destroy()
        @page.destroy()
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 7]]

    def edit()
        id = params[:id]
        @page = Page.find(id)
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def index()
       @pages = Page.all
---
SELECT "pages".* FROM "pages"

    def update()
        @page.update(page_params)
---
UPDATE "pages" SET "slug" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["slug", "aboutasdf"], ["updated_at", "2020-01-10 01:17:42.848400"], ["id", 2]]

    def create()
        @page = Page.new(page_params)
        @page.save
---
INSERT INTO "pages" ("title", "body", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Amazing title"], ["body", ""], ["slug", ""], ["created_at", "2020-01-10 00:56:37.209347"], ["updated_at", "2020-01-10 00:56:37.209347"]]

        def set_page
            @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]