app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def show()
        @page = Page.find(params[:id])